//
//  features.swift
//  250205proj
//
//  Created by 안세훈 on 2/5/25.
//

struct features {
    
    var phoneBook : [model] = [
        model(name: "안세훈", number: 01012345678),
        model(name: "홍길동", number: 01012341234)]
    
    func input(){
        print("               :::: 전화번호부 ::::               ")
        print("----------------------MENU--------------------")
        print("---------------------입력 기능--------------------")
        
    }
    
    func output(){
        print("               :::: 전화번호부 ::::               ")
        print("----------------------MENU--------------------")
        print("---------------------출력 기능--------------------")
        
    }
    
    func search(){
        print("               :::: 전화번호부 ::::               ")
        print("----------------------MENU--------------------")
        print("---------------------검색 기능--------------------")
        
    }
    
    func edit(){
        print("               :::: 전화번호부 ::::               ")
        print("----------------------MENU--------------------")
        print("---------------------수정 기능--------------------")
        
    }
    
    func delete(){
        print("               :::: 전화번호부 ::::   3            ")
        print("----------------------MENU--------------------")
        print("---------------------삭제 기능--------------------")
        
    }
}
